// Подготовил Бабкин Иван Анатольевич, группа 9302, дата начала 10.09.2019, v1.3.0
// Полином 6: 3214.432x^10 + 324.908x^9 - 23.754
// Полином 1: x^7 + 4x^6 + 2x - 3

#include <iostream>
#include <stdio.h>
using namespace std;

void main()
{
	setlocale(LC_ALL, "rus");

	double x, p6, p1, y5, y9, res;

	printf ("Подготовил Бабкин Иван Анатольевич, группа 9302, дата начала 10.09.2019, v1.3.0\n");
	printf ("Полином 6: 3214.432x^10 + 324.908x^9 - 23.754\n");
	printf ("Полином 1: x^7 + 4x^6 + 2x - 3\n");
	printf ("Введите х в пределах (-10^3; -10^-3)v{0}v(10^-3; 10^3)\n");
	scanf_s ("%lf", &x);

	y5 = x * x * x * x * x; //x^5
	y9 = x * x * x * x * x * x * x * x * x; //x^9

	p6 = 3214.432 * x + 324.908;
	printf ("Шаг 1 %20.3lf %c", p6, '\n');

	p6 = p6 * y9 - 23.754;
	printf ("Шаг 2 %20.3lf %c", p6, '\n');

	p1 = x + 4;
	printf ("Шаг 3 %20.3lf %c", p1, '\n');

	p1 = p1 * y5 + 2;
	printf ("Шаг 4 %20.3lf %c", p1, '\n');

	p1 = p1 * x - 3;
	printf ("Шаг 5 %20.3lf %c", p1, '\n');

	res = p6 / p1;

	printf("Результат при р6/р1 х = %lf %s %20.3lf %c", x, " равен ", res, '\n');

	system("pause");
}